# 1. გააკეთეთ თითო მაგალითი
a = 10
b = 5
print(a + b)
print(a - b)
print(a * b)
print(a / b)
# 2. 2) შექმენით 5 ცვლადი -->
# პირველ ცვლადში შეინახეთ ინფორმაცია თქვენი სახელის შესაახებ.

# მეორე ცვლადში შეინახეთ ინფორმაცია თქვენი ასაკის შესახებ.

# მესამე ცვლადში შეინახეთ ინფორმაცია თქვენი საყვარელი ფერის შესახებ.
name = "deniel"
age = 14
fav_color = "Purple"

# ააგეთ ერთი დიდი წინადადება ცვლადების დახმარებით როგორც გაკვეთილზე მაგალითის სახით გავაკეთეთ.
full_sentence = "მე ვარ " + name + ", ვარ " + str(age) + " წლის, და ჩემი საყვარელი ფერი არის " + fav_color + "."
print(full_sentence)