# 2) კომენტარების სახით თქვენი სიტყვებით ახსენით ყველა მონაცემთა ტიპი (string, integer, float)

# string (სტრინგი) — ტექსტური მონაცემია რომელიც გამოიყენება სიტყვების, წინადადებების ან სიმბოლოების შესანახად 
# მაგალითი: "გამარჯობა", "დენიელ", "Python"

# integer (მთელი რიცხვი) — მთელი რიცხვები რომელიც არ შეიცავს ათწილადს.
# მაგალითი: 5, -10, 100

# float (ათწილადი რიცხვი) — რიცხვი რომელშიც ეწერება წერტილი ანუ ათწილადია
# მაგალითი: 3.14, 10.0, -2.5

# --------

# 3) კომენტარების სახით თქვენი სიტყვებით ახსენით რა არის ცვლადი და რაში ვიყენებთ მათ.

# ცვლადი არის სახელი, რომელშიც ვინახავთ მონაცემს.
# მას ვიყენებთ იმისთვის, რომ ინფორმაცია შევინახოთ და მერე როცა დაგვჭირდება გამოვიყენოთ პროგრამაში.
# მაგალითად: შეგვიძლია გამოვიყენოთ ცვლაი რომ შევინახოთ ასაკი, სახელი, რიცხვები და ა.შ.

# --------

# 4) print() ფუნქციის დახმარებით დაბეჭდეთ 5 string ტიპის მნიშნელობა, 5 integer ტიპის მნიშვნელობა, 5 float ტიპის მნიშვნელობა.

print("Apple")
print("Python")
print("Georgia")
print("School")
print("Computer")

print(1)
print(25)
print(-7)
print(100)
print(2026)

print(3.14)
print(10.5)
print(-2.7)
print(0.99)
print(100.0)


# 5) შექმენით 5 სხვადასხვა ცვლადი. ცვლადებში შეინახეთ თქვენთვის სასურველი მნიშვნელობები და შემდეგ დაბეჭდეთ ერთი დიდი წინადადება ერთი print() ფუნქციის მეშვეობით.ა

name = "დენიელ"
age = 14
city = "თბილისი"
height = 1.75
hobby = "კომპიუტერული თამაშები"

print("ჩემი სახელი არის " + name + ", მე ვარ " + str(age) + " წლის, მე ვცხოვრობ " + city + ", ჩემი სიმაღლე " + str(height) + " მეტრი და მე მომწონს " + hobby + ".")


# 6) გააკეთეთ 3-3 მაგალითი ყველა მათემატიკურ ოპერაციებზე.

# დამატება
print(5 + 3)
print(10 + 20)
print(7 + 8)

# გამოკლება
print(10 - 5)
print(20 - 7)
print(100 - 30)

# გამრავლება 
print(4 * 5)
print(6 * 7)
print(3 * 9)

# გაყოფა
print(10 / 2)
print(9 / 3)
print(7 / 2)


# 7) შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი termian-ში.

num1 = 5
num2 = 10
num3 = 15

print(num1 + num2 + num3)
